app/views/students/show.html.erb


<% @student.courses.each do |c| %>
---
SELECT "courses".* FROM "courses" INNER JOIN "courses_students" ON "courses"."id" = "courses_students"."course_id" WHERE "courses_students"."student_id" = $1  [["student_id", 1]]

    <h4><%= link_to c.name, course_path(c) %></h4><br>
    <progress value="<%= current_student.progress.concepts.where(course_id: c.id).count %>" max="<%= c.concepts.count %>" class="progress"></progress><br>
---
SELECT COUNT(*) FROM "concepts" INNER JOIN "concepts_progresses" ON "concepts"."id" = "concepts_progresses"."concept_id" WHERE "concepts_progresses"."progress_id" = $1 AND "concepts"."course_id" = $2  [["progress_id", 1], ["course_id", 1]]

<% end %>
<% if @student.courses.count == 0 %>
---
SELECT COUNT(*) FROM "courses" INNER JOIN "courses_students" ON "courses"."id" = "courses_students"."course_id" WHERE "courses_students"."student_id" = $1  [["student_id", 1]]