app/views/instructors/index.html.erb

SELECT COUNT(*) FROM "courses" WHERE "courses"."instructor_id" = $1  [["instructor_id", 1]]
---
  <h2><%= i.name %></h2><br>
  <p>Courses: <%= i.courses.count %></p>