app/views/instructors/show.html.erb

<% end %>
<% if @instructor.courses.count > 0 %>
---
SELECT "courses".* FROM "courses" WHERE "courses"."instructor_id" = $1  [["instructor_id", 1]]
SELECT COUNT(*) FROM "courses" WHERE "courses"."instructor_id" = $1  [["instructor_id", 1]]