app/views/subjects/index.html.erb

    <h4><%= s.name %></h4><br>
    <p>Available courses: <%= s.courses.count %></p><br>
---
SELECT COUNT(*) FROM "courses" WHERE "courses"."subject_id" = $1  [["subject_id", 1]]