app/views/subjects/show.html.erb


<% @subject.courses.each do |c| %>
---
SELECT "courses".* FROM "courses" WHERE "courses"."subject_id" = $1  [["subject_id", 3]]

      <% if student_logged_in? %>
        <% unless current_student.courses.include? c %>
---
SELECT  1 AS one FROM "courses" INNER JOIN "courses_students" ON "courses"."id" = "courses_students"."course_id" WHERE "courses_students"."student_id" = $1 AND "courses"."id" = $2 LIMIT 1  [["student_id", 5], ["id", 2]]