app/views/concepts/show.html.erb

SELECT  "exercises".* FROM "exercises" WHERE "exercises"."concept_id" = $1  ORDER BY "exercises"."id" ASC LIMIT 1  [["concept_id", 4]]
SELECT  "progresses".* FROM "progresses" WHERE "progresses"."student_id" = $1 LIMIT 1  [["student_id", 1]]
SELECT  1 AS one FROM "exercises" INNER JOIN "exercises_progresses" ON "exercises"."id" = "exercises_progresses"."exercise_id" WHERE "exercises_progresses"."progress_id" = $1 AND "exercises"."id" = $2 LIMIT 1  [["progress_id", 2], ["id", 1]]
---

<% unless student_logged_in? && @concept.exercises.count > 0 && current_student.progress.include?(@concept.exercise.first) %>