app/views/courses/edit.html.erb

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = $1 LIMIT 1  [["id", 1]]
---
<% end %>
<%= link_to "Back", instructor_path(Instructor.find(1)) %>