app/views/courses/show.html.erb

SELECT "concepts".* FROM "concepts" WHERE "concepts"."course_id" = $1  [["course_id", 1]]
SELECT  "progresses".* FROM "progresses" WHERE "progresses"."student_id" = $1 LIMIT 1  [["student_id", 1]]
SELECT  1 AS one FROM "concepts" INNER JOIN "concepts_progresses" ON "concepts"."id" = "concepts_progresses"."concept_id" WHERE "concepts_progresses"."progress_id" = $1 AND "concepts"."id" = $2 LIMIT 1  [["progress_id", 2], ["id", 2]]
---
<h1><%= @course.name %></h1>
<% @course.concepts.each do |c| %>
  <div class="concept">
    <h4><% if instructor_logged_in? || (student_logged_in? && current_student.progress.concepts.include?(c)) %>