app/controllers/concepts_controller.rb

SELECT  "concepts".* FROM "concepts" WHERE "concepts"."id" = $1 LIMIT 1  [["id", 2]]
---
  def show
    @concept = Concept.find(params[:id])

SELECT  "concepts".* FROM "concepts" WHERE "concepts"."id" = $1 LIMIT 1  [["id", 4]]
SELECT "exercises".* FROM "exercises" WHERE "exercises"."concept_id" = $1  [["concept_id", 4]]
SELECT COUNT(*) FROM "exercises" WHERE "exercises"."concept_id" = $1  [["concept_id", 4]]
SELECT  "progresses".* FROM "progresses" WHERE "progresses"."student_id" = $1 LIMIT 1  [["student_id", 5]]
SELECT  1 AS one FROM "exercises" INNER JOIN "exercises_progresses" ON "exercises"."id" = "exercises_progresses"."exercise_id" WHERE "exercises_progresses"."progress_id" = $1 AND "exercises"."id" = $2 LIMIT 1  [["progress_id", 5], ["id", 4]]
---
  def next
    @concept = Concept.find(params[:id])
    if @concept.exercises.count > 0
      @concept.exercises.each do |e|
        unless current_student.progress.exercises.include? e

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", nil]]
---
  def new
    @@id = params[:id]
    @concept = Course.find(@@id).concepts.new

SELECT  "concepts".* FROM "concepts" WHERE "concepts"."id" = $1 LIMIT 1  [["id", 2]]
---
  def edit
    @concept = Concept.find(params[:id])

SELECT  "concepts".* FROM "concepts" WHERE "concepts"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "concepts" SET "content" = $1, "updated_at" = $2 WHERE "concepts"."id" = $3  [["content", "Don't suck."], ["updated_at", "2016-02-23 17:33:32.331390"], ["id", 2]]
---
  def update
    @concept = Concept.find(params[:id])

    if @concept.update_attributes(concept_params)