app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
---
  def enroll
    @course = Course.find(params[:id])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "progresses".* FROM "progresses" WHERE "progresses"."student_id" = $1 LIMIT 1  [["student_id", 5]]
SELECT  1 AS one FROM "concepts" INNER JOIN "concepts_progresses" ON "concepts"."id" = "concepts_progresses"."concept_id" WHERE "concepts_progresses"."progress_id" = $1 AND "concepts"."id" = $2 LIMIT 1  [["progress_id", 5], ["id", 4]]
SELECT "concepts".* FROM "concepts" INNER JOIN "concepts_progresses" ON "concepts"."id" = "concepts_progresses"."concept_id" WHERE "concepts_progresses"."progress_id" = $1  [["progress_id", 5]]
---
  def continue
    @course = Course.find(params[:id])
    unless current_student.progress.concepts.include? @course.concepts.first

SELECT  "subjects".* FROM "subjects"  ORDER BY "subjects"."id" ASC LIMIT 1
---
  def new
    @course = Course.new
    @subjects = Subject.all

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "courses" ("name", "description", "subject_id", "instructor_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Buttsing"], ["description", "Learn how to butts!"], ["subject_id", 3], ["instructor_id", 1], ["created_at", "2016-02-23 22:30:36.152559"], ["updated_at", "2016-02-23 22:30:36.152559"]]
---
  def create
    @course = Instructor.find(session[:instructor_id]).courses.new(course_params)

    if @course.save

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 7]]
SELECT "subjects".* FROM "subjects"
---
  def edit
    @course = Course.find(params[:id])
    @subjects = Subject.all

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 7]]
UPDATE "courses" SET "name" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["name", "Making Courses..?"], ["updated_at", "2016-02-25 22:44:47.923383"], ["id", 1]]
SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = $1 LIMIT 1  [["id", 1]]
---
  def update
    @course = Course.find(params[:id])

    if @course.update_attributes(course_params)
      redirect_to instructor_path(Instructor.find(session[:instructor_id]))

DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 4]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 4]]
SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = $1 LIMIT 1  [["id", 1]]
---
  def destroy
    Course.find(params[:id]).destroy
    redirect_to instructor_path(Instructor.find(session[:instructor_id]))