app/controllers/exercises_controller.rb

  def show
    @exercise = Exercise.find(params[:id])
---
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT 1  [["id", 3]]

  def new
    @@id = params[:id]
    @exercise = Concept.find(@@id).exercises.new
---
SELECT  "concepts".* FROM "concepts" WHERE "concepts"."id" = $1 LIMIT 1  [["id", 2]]

  def create
    @exercise = Concept.find(@@id).exercises.new(exercise_params)

    if @exercise.save
---
SELECT  "concepts".* FROM "concepts" WHERE "concepts"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "exercises" ("name", "content", "answer", "concept_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["content", "<h1>blaaah</h1>"], ["answer", ""], ["concept_id", 2], ["created_at", "2016-02-26 00:44:55.294000"], ["updated_at", "2016-02-26 00:44:55.294000"]]

  def edit
    @exercise = Exercise.find(params[:id])
---
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT 1  [["id", 3]]

  def update
    @exercise = Exercise.find(params[:id])
---
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT 1  [["id", 3]]

  def destroy
    c = Exercise.find(params[:id]).concept
    Exercise.find(params[:id]).destroy
---
SELECT  "concepts".* FROM "concepts" WHERE "concepts"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT 1  [["id", 8]]
DELETE FROM "exercises" WHERE "exercises"."id" = $1  [["id", 8]]