app/controllers/instructors_controller.rb

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @instructor = Instructor.find(params[:id])

INSERT INTO "instructors" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @instructor = Instructor.new(instructor_params)

    if @instructor.save

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = $1 LIMIT 1  [["id", 2]]
---
  def edit
    @instructor = Instructor.find(params[:id])

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "instructors" SET "name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "instructors"."id" = $4  [["name", "doomed!"], ["password_digest", "$2a$10$tolPxvOOcxOo9BIqTQJNY.ufxEZ3tjbFVCdrJNPVjPlgQcydqDVtq"], ["updated_at", "2016-02-22 22:39:08.298659"], ["id", 2]]
---
  def update
    @instructor = Instructor.find(params[:id])

    if @instructor.update_attributes(instructor_params)

DELETE FROM "instructors" WHERE "instructors"."id" = $1  [["id", 2]]
SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = $1 LIMIT 1  [["id", 2]]
---
  def destroy
    Instructor.find(params[:id]).destroy()