app/controllers/sessions_controller.rb

  def create
    if @@type == "instructor"
      @instructor  = Instructor.find_by({name: params[:name]})
      if @instructor && @instructor.authenticate(params[:password])
        session[:instructor_id] = @instructor.id
        flash[:success] = "Welcome, #{@instructor.name}"
        redirect_to instructor_path(@instructor)
      else
        flash[:failure] = "Login unsuccessful"
        redirect_to new_session_path + "?type=instructor"
      end
    elsif @@type == "student"
      @student  = Student.find_by({name: params[:name]})
---
SELECT  "instructors".* FROM "instructors" WHERE "instructors"."name" = $1 LIMIT 1  [["name", "professor_unpleasant"]]
SELECT  "students".* FROM "students" WHERE "students"."name" = $1 LIMIT 1  [["name", "testes"]]