app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    if @student.save
      @student.progress = Progress.create
---
INSERT INTO "students" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "fuck"], ["password_digest", "$2a$10$VSvWZApphtbj5w8pgO.eLewAIv8Z.NgEJ4Q2y9onu2BEkQCti96IS"], ["created_at", "2016-02-26 16:07:25.380898"], ["updated_at", "2016-02-26 16:07:25.380898"]]
INSERT INTO "progresses" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2016-02-26 16:07:25.418479"], ["updated_at", "2016-02-26 16:07:25.418479"]]