app/controllers/subjects_controller.rb

INSERT INTO "subjects" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Basic Ass Shit"], ["created_at", "2016-02-23 21:52:41.749298"], ["updated_at", "2016-02-23 21:52:41.749298"]]
---
  def create
    @subject = Subject.new(subject_params)

    if @subject.save

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT 1  [["id", 2]]
---
  def edit
    @subject = Subject.find(params[:id])

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "subjects" SET "name" = $1, "updated_at" = $2 WHERE "subjects"."id" = $3  [["name", "Doomedness"], ["updated_at", "2016-02-23 22:04:30.125853"], ["id", 2]]
---
  def update
    @subject = Subject.find(params[:id])

    if @subject.update_attributes(subject_params)

DELETE FROM "subjects" WHERE "subjects"."id" = $1  [["id", 2]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT 1  [["id", 2]]
---
  def destroy
    Subject.find(params[:id]).destroy