app/views/exercises/show.html.erb

SELECT  "progresses".* FROM "progresses" WHERE "progresses"."student_id" = $1 LIMIT 1  [["student_id", 5]]
SELECT  1 AS one FROM "exercises" INNER JOIN "exercises_progresses" ON "exercises"."id" = "exercises_progresses"."exercise_id" WHERE "exercises_progresses"."progress_id" = $1 AND "exercises"."id" = $2 LIMIT 1  [["progress_id", 5], ["id", 4]]
---

<% if instructor_logged_in? || (student_logged_in? && current_student.progress.exercises.include?(@exercise)) %>

SELECT  "concepts".* FROM "concepts" WHERE "concepts"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  1 AS one FROM "courses" INNER JOIN "courses_students" ON "courses"."id" = "courses_students"."course_id" WHERE "courses_students"."student_id" = $1 AND "courses"."id" = $2 LIMIT 1  [["student_id", 5], ["id", 2]]
---

<% if student_logged_in? && current_student.courses.include?(@exercise.concept.course) && !current_student.progress.exercises.include?(@exercise) %>